Tekla Open API Reference for Tekla Structures 2025
Shell Class
 The Shell class represents a single shell in a solid.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Solid.Shell
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class Shell
Public NotInheritable Class Shell
The Shell type exposes the following members.
Methods
Name | Description
GetEdgeEnumerator
 Returns a new edge enumerator in the current plane.
GetFaceEnumerator
 Returns a new face enumerator in the current plane.
Top
See Also
Reference
Tekla.Structures.Solid Namespace